# AirBNB data ETL

https://www.kaggle.com/airbnb/seattle

http://insideairbnb.com/get-the-data/

TODO: Make this a script that runs on docker-compose up

## setup

In [18]:
from dataclasses import dataclass
from dotenv import load_dotenv
import os
import pandas as pd

In [19]:
load_dotenv()

True

In [20]:
@dataclass
class PSet:
    pg_url: str = os.getenv('DATASTORE_URL')
    data_url: str = 'http://data.insideairbnb.com/united-states/dc/washington-dc/2021-12-15/data'
    
    @classmethod
    def get_data(cls, filename: str) -> pd.DataFrame:
        url = f'{cls.data_url}/{filename}'
        print("loading:", url)
        return pd.read_csv(f'{cls.data_url}/{filename}')
    
pset = PSet()
pset

PSet(pg_url='postgresql://postgres:postgres@localhost:5437/airbnb', data_url='http://data.insideairbnb.com/united-states/dc/washington-dc/2021-12-15/data')

## data

### Load data from AirBnB

In [21]:
listing_df = pset.get_data('listings.csv.gz')
listing_df.shape

loading: http://data.insideairbnb.com/united-states/dc/washington-dc/2021-12-15/data/listings.csv.gz

(7892, 74)

In [22]:
calendar_df = pset.get_data('calendar.csv.gz')
calendar_df.shape

loading: http://data.insideairbnb.com/united-states/dc/washington-dc/2021-12-15/data/calendar.csv.gz

(2879485, 7)

In [23]:
reviews_df = pset.get_data('reviews.csv.gz')
reviews_df.shape

loading: http://data.insideairbnb.com/united-states/dc/washington-dc/2021-12-15/data/reviews.csv.gz

(315362, 6)

In [24]:
neighborhoods_df = pd.read_csv('http://data.insideairbnb.com/united-states/dc/washington-dc/2021-12-15/visualisations/neighbourhoods.csv')
neighborhoods_df.shape

(39, 2)

### push to datastore (PG)

In [25]:
from sqlalchemy import create_engine

engine = create_engine(pset.pg_url)
pd.read_sql('select 1 as foo', engine)

   foo
0    1

In [26]:
listing_df.to_sql(
    'listings',
    con=engine,
    index=False,
    if_exists='replace',
    method='multi',
    chunksize=10000
)

7892

In [27]:
pd.read_sql('select id from listings limit 3', engine)

     id
0  3686
1  3943
2  4529

In [28]:
calendar_df.to_sql(
    'calendar',
    con=engine,
    index=False,
    if_exists='replace',
    method='multi',
    chunksize=1000000
)

2879485

In [29]:
pd.read_sql('select * from calendar limit 3', engine)

,listing_id,date,available,price,adjusted_price,minimum_nights,maximum_nights
0,3943,2021-12-15,t,$70.00,$70.00,2.0,1125.0
1,3943,2021-12-16,t,$70.00,$70.00,2.0,1125.0
2,3943,2021-12-17,f,$70.00,$70.00,2.0,1125.0

In [30]:
reviews_df.to_sql(
    'reviews',
    con=engine,
    index=False,
    if_exists='replace',
    method='multi',
    chunksize=100000
)

315362

In [31]:
pd.read_sql('select * from reviews limit 3', engine)

,listing_id,id,date,reviewer_id,reviewer_name,comments
0,3686,131293,2010-11-01,257234,Callie,Staying with Levita and her wonderful family w...
1,3686,150766,2010-12-08,255888,Patrick,"Vita is a very welcoming, helpful and friendly..."
2,3686,177749,2011-02-02,366688,Benjamin,"This was my first time using ""airbnb"" and it m..."

In [32]:
neighborhoods_df.to_sql(
    'neighborhoods',
    con=engine,
    index=False,
    if_exists='replace',
    method='multi',
    chunksize=100
)

39

In [33]:
pd.read_sql('select * from neighborhoods limit 3', engine)

  neighbourhood_group                         neighbourhood
0                None  Brightwood Park, Crestwood, Petworth
1                None         Brookland, Brentwood, Langdon
2                None            Capitol Hill, Lincoln Park